
Функция ПриемСообщейнийPOST(Запрос)   	    
	TextJSON = Запрос.ПолучитьТелоКакСтроку();
	ЗапросСоотвествие = api_ПроцедурыОбмена.РаспаковатьИзJSON(TextJSON);
	
	Если Не ТипЗнч(ЗапросСоотвествие) = Тип("Соответствие") Тогда
		Ответ = Новый HTTPСервисОтвет(400);   
		
		ОтветСоотвествие = Новый Соответствие;
		ОтветСоотвествие.Вставить("msg", "Invalid JSON");
		ОтветСоотвествие.Вставить("status", "Error");
		
		Ответ.УстановитьТелоИзСтроки(api_ПроцедурыОбмена.УпаковатьВJSON(ОтветСоотвествие));
		
		Возврат Ответ;
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	РезультатОбработки = Оргструкутры_Процедуры.ОбработкаЗапроса(ЗапросСоотвествие);
	Ответ.УстановитьТелоИзСтроки(api_ПроцедурыОбмена.УпаковатьВJSON(РезультатОбработки));
	
	//Если ТипЗнч(ЗапросСоотвествие.Получить("ID")) = Тип("Массив") Тогда
	//	ОтветСтрукутра = Новый Структура;
	//	ОтветСтрукутра.Вставить("message", "в id массив");
	//	Ответ.УстановитьТелоИзСтроки(api_ПроцедурыОбмена.УпаковатьВJSON(ОтветСтрукутра));
	//Иначе
	//	ОтветСтрукутра = Новый Структура;
	//	ОтветСтрукутра.Вставить("message", "в id не массив");
	//	Ответ.УстановитьТелоИзСтроки(api_ПроцедурыОбмена.УпаковатьВJSON(ОтветСтрукутра));
	//КонецЕсли;
	
	
	
	Возврат Ответ;     
КонецФункции
